package homework03;

public class Task06_evenNumbers {
    public static void main(String[] args) {
//          6)Напишите программу вывода всех четных чисел от 2 до 100 включительно

        for (int i = 2; i <= 100; i += 2) {
                System.out.println(i);
        }
    }
}
